<template>
	<div>
		<h2 class="my-4 text-light d-flex justify-content-center mb-4">О проекте</h2>
		<div class="mt-2 bg-light rounded px-2 py-2 mb-4 col-sm-8 mx-auto">
			<h3 class="my-2">Регистрация</h3>
				<p class="fs-6 my-1">
					Для регистрации не требуется иметь email, просто какой-нибудь уникальный никнейм
				</p>
				<p class="fs-6 my-1">
					Пароль должен быть не меньше 6 символов
				</p>
		</div>
		<div class="mt-2 bg-light rounded px-2 py-2 mb-4 col-sm-8 mx-auto">
			<h3 class="my-2">Главная Страница</h3>
				<p class="fs-6 my-1">
					Создавайте свои задачи на день, выбирая из двух вариантов. Каждый день начинается новый день, и 
					посмотреть предыдущий можно только уже на странице - дни. 
				</p>
				<p class="fs-6 my-1">
					Отрицательные задачи будут выполнены только в том случае, если не превысится лимит их времени 
					до окончания дня. Следует дожидаться окончания дня, иначе, если день не закончился, и Вы зашли 
					в это приложение на следующий день, то предыдущий день навсегда потерян и его нельзя будет больше 
					найти.
				</p>
				<p class="fs-6 my-1">
					Окончания дня меняется в настройках профиля
				</p>
		</div>
		<div class="mt-2 bg-light rounded px-2 py-2 mb-4 col-sm-8 mx-auto">
			<h3 class="my-2">Подписки</h3>
				<p class="fs-6 my-1">
					Здесь будет список пользователей, на которых Вы подписаны
				</p>
		</div>
		<div class="mt-2 bg-light rounded px-2 py-2 mb-4 col-sm-8 mx-auto">
			<h3 class="my-2">Профили</h3>
				<p class="fs-6 my-1">
					Здесь будет список пользователей этого проекта, переходя по которым Вы сможете на них 
					подписаться или отписаться, а также посмотреть их статистику по трем последним дням. Если 
					этот пользователь только начал пользоваться этим приложением и еще не успел закончить три 
					дня, то статистика будет пустая.
				</p>
				<p class="fs-6 my-1">
					Также, чтобы найти какого-нибудь конкретного пользователя, введите его имя в поиске
				</p>
		</div>
		<div class="mt-2 bg-light rounded px-2 py-2 mb-4 col-sm-8 mx-auto">
			<h3 class="my-2">Дни</h3>
				<p class="fs-6 my-1">
					Здесь будет список пользователей Ваших уже законченных дней, кликая по которым Вы сможете 
					посмотреть, какие задачи были выполнены в тот день, а какие нет
				</p>
				<p class="fs-6 my-1">
					Также введите дату в поиске, если хотите найти конкретный день
				</p>
		</div>
		<div class="mt-2 bg-light rounded px-2 py-2 mb-4 col-sm-8 mx-auto">
			<h3 class="my-2">Профиль</h3>
				<p class="fs-6 my-1">
					Здесь Вы сможете редактировать свой профиль, а также посмотреть статистику за последние три дня. 
					Если Вы только начали пользоваться этим приложением и еще не успели закончить три дня, то статистика 
					будет пустая.  
				</p>
				<p class="fs-6 my-1">
					Поставить новый аватар возможно, но только на время, так как heroku не сохраняет картинки. 
					Изменив окончание дня, новый день будет заканчиваться в это время. 
				</p>
		</div>
	</div>
</template>

<script>

export default {

}
</script>